using System.Text;

class Program
{
    static void Main()
    {
        Console.OutputEncoding = Encoding.UTF8;
        Console.InputEncoding = Encoding.Unicode;
        // В этом задании вам нужно создать список дел.
        // Исплоьзуйте массив или лист для хранения списка дел.
        // При запуске программа должна выводить меню на экран и ждать дальнейших действий пользователя.
        // После выполнения действия программа должна снова выводить меню и ждать дальнейших действий пользователя.
        // Все действия должны выполняться до тех пор, пока пользователь не выберет пункт "Выход".
        
        
        while (true)
        {
            Console.WriteLine("Список дел:");
            // Выводим список задач
            
            // Выводим меню
            
            // Считываем выбор пользователя
            
            // Обрабатываем выбор пользователя
            
            
            // 1. Добавить задачу
                // Считываем задачу
                // Добавляем задачу
            
            
            // 2. Удалить задачу
                // Считываем номер задачи
                // Удаляем задачу
                // Если ввод некорректный, выводим сообщение об ошибке
                
            // 3. Выход
                // Выходим из программы
                
            // Ввод за пределами меню
                // Выводим сообщение об ошибке
        }
    }
}